app/controllers/addresses_controller.rb

SELECT "addresses".* FROM "addresses"
---
    def index
        render json: Address.all