app/controllers/admins_controller.rb

    def index
        render json: Admin.all
---
SELECT "admins".* FROM "admins"

    def create
        admin = Admin.create(admin_params)
---
INSERT INTO "admins" ("email", "username", "name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"