app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "johndoe@example.com"], ["LIMIT", 1]]
SELECT "admins".* FROM "admins" WHERE "admins"."email" = $1 LIMIT $2  [["email", "johndoe@example.com"], ["LIMIT", 1]]
---
  def authenticate
    user = User.find_by(email: login_params[:email])
    admin = Admin.find_by(email: login_params[:email])