app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
    def index
    render json: Category.all

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        render json: Category.find(params[:id])

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def update
        categories = Category.find(params[:id])