app/controllers/orders_controller.rb

   def index
    orders=Order.all
---
SELECT "orders".* FROM "orders"

    def show_invoice
      order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]