app/controllers/products_controller.rb

    def show
        render json: Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        products = Product.new(product_params)
        if products.save!
---
INSERT INTO "products" ("image", "title", "description", "quantity", "price", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def update
        product = Product.find_by(id: params[:id])
        if product.update(product_params)
          products = Product.all # Get the updated list of products
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "image" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["image", "#<ActionDispatch::Http::UploadedFile:0x00007f9f5c01a498>"], ["updated_at", "2023-04-24 14:13:59.642243"], ["id", 2]]
SELECT "products".* FROM "products"