app/controllers/reviews_controller.rb

    def index
        render json: Review.all
---
SELECT "reviews".* FROM "reviews"