app/controllers/users_controller.rb

def create
    user= User.new(users_params)
    if user.save
---
INSERT INTO "users" ("email", "name", "phone_number", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"